app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a test article"], ["body", "the test article body text"], ["created_at", "2016-03-07 00:04:13.764729"], ["updated_at", "2016-03-07 00:04:13.764729"]]
---
  def create
    #make the new article record
    @article = Article.create(article_params)